Repository: Eralo/EasySave
Catalog: ProjetDevSysGraphical/Messages.*.resx
Languages: fr

# Config.Apply
source: Apply
fr: Appliquer

# Config.Blocker1
source: Blocker processes : if detected backup is interrupted
fr: Processus bloquants

# Config.Blocker2
source: Insert a Process name :
fr: Processus :

# Config.Crypto1
source: CryptoSave Configuration
fr: CryptoSave

# Config.Crypto2
source: CryptoSave Path :
fr: Chemin du logiciel :

# Config.Crypto3
source: CryptoSave extensions to encrypt :
fr: Extensions à chiffrer :

# Config.FileSize0
source: Size of heavy files
fr: Taille minimale des fichiers lourds

# Config.FileSize1
source: Size:
fr: Taille minimale :

# Config.FileSize2
source: Unit:
fr: Unité :

# Config.Languages1
source: Change localization
fr: Langue

# Config.Languages2
source: Select a language :
fr: Langue :

# Config.Log1
source: Log Files Configuration
fr: Fichiers de logs

# Config.Log2
source: Daily Log Path :
fr: Chemin des logs journaliers :

# Config.Log3
source: Real-Time Log Path :
fr: Chemin des logs en temps réel :

# Config.Log4
source: Logs Extension type :
fr: Type d'extension :

# Config.Priority1
source: Priority files
fr: Fichiers prioritaires

# Config.Priority3
source: Extension of files to prioritize:
fr: Extension à prioriser :

# Config.Reset
source: Reset
fr: Réinitialiser

# Config.SavePath1
source: Path to backups save file
fr: Sauvegarde des tâches

# Config.SavePath2
source: Insert the path to your backups save file :
fr: Fichier de sauvegarde :

# Config.Serv0
source: Remote interface
fr: Interface déportée

# Config.Serv1
source: Turn on the server:
fr: Allumer le serveur :

# Config.Tab1
source: Log Files
fr: Fichiers logs

# Config.Tab3
source: Language
fr: Langues

# Config.Tab4
source: Blocker Process
fr: Processus bloquants

# Config.Tab5
source: Save Paths
fr: Chemin de sauvegarde

# Config.Themes1
source: App theme
fr: Thème de l'application

# Config.Themes2
source: Theme:
fr: Thème :

# Home1
source: Welcome !
fr: Bienvenue !

# ResetConfig
source: Are you sure you want to reset all settings ?
fr: Voulez vous vraiment réinitialiser les paramètres ?

# RunTaskView11
source: Save done
fr: Sauvegarde effectuée

# RunTaskView12
source: saves done
fr: sauvegardes effectuées

# RunTaskView4
source: A Blocker process is in use (your backups will be done when the process is closed)
fr: Un processus Bloquant est en cours d'utilisation (vos sauvegardes seront effectuées lorsque le processus sera fermé)

# RunTaskView5
source: Processus Error
fr: Processus Erreur

# RunTaskView6
source: All the saves are done
fr: Toutes les sauvegardes ont été effectuées

# Selector1
source: Home
fr: Accueil

# Selector2
source: Saves
fr: Sauvegarde

# StartupPopup1
source: Proceedings are already underway.
fr: Une instance est déjà en cours.

# Task.Add.Title
source: Add a task
fr: Ajouter une tâche

# Task.AddButton
source: Add a task
fr: Ajouter une tâche

# Task.Apply
source: Apply
fr: Valider

# Task.Cancel
source: Cancel
fr: Annuler

# Task.Delete
source: Result
fr: Tâche supprimée avec succès

# Task.DeleteInfo
source: Task deleted successfully
fr: Résultat

# Task.Edit.Title
source: Edit a task
fr: Editer une tâche

# Task.Grid.Delete
source: Delete
fr: Supprimer

# Task.Grid.Edit
source: Edit
fr: Editer

# Task.Grid.Name
source: Name
fr: Nom

# Task.Grid.Select
source: Select
fr: Sélectionner

# Task.Grid.Target
source: Target
fr: Cible

# Task.LaunchAll
source: Launch every tasks
fr: Lancer toutes les tâches

# Task.LaunchSelect
source: Launch all selected tasks
fr: Lancer les tâches sélectionnées

# Task.Popup.Add1
source: Problem: source doesn't exist
fr: Problème : la source n'existe pas

# Task.Popup.Add2
source: Problem: target doesn't exist
fr: Problème : la cible n'existe pas

# Task.Popup.Add3
source: Problem: source and target doesn't exist
fr: Problème : ni la source ni la cible n'existent

# Task.Popup.Add4
source: Please fill out all the entries
fr: Veuillez fournir toutes les informations

# Task.Popup.Out
source: Result
fr: Résultat

# Task.Popup.Warning
source: Problem
fr: Problème

# Task.Type1
source: Complete
fr: Complète

# Task.Type2
source: Differential
fr: Differentielle
