Repository: Eralo/EasySave
Catalog: ProjetDevSys/Messages.*.resx
Languages: fr

# AppConstants1
source: Error while reading the configuration
fr: Erreur lors de la lecture de la configuration.

# BackupFactory1
source: A backup with the same name already exists.
fr: Une backup avec le même nom existe déjà.

# BackupJob1
source: Unsupported backup type.
fr: Type de sauvegarde non supporté.

# ConfigText1
source: CryptoSoft Folder dooesn't exist. Downloading...
fr: Le dossier CryptoSoft n'existe pas. Téléchargement en cours...

# ConfigText2
source: Download complete. Extracting...
fr: Téléchargement terminé. Extraction en cours...

# ConfigText3
source: Extract complete. Folders availables in
fr: Extraction terminée. Fichiers disponibles dans

# ConfigText4
source: An error occured :
fr: Une erreur est survenue :

# ConfigText5
source: CryptoSoft folder already exists.
fr: Le dossier CryptoSoft existe déjà.

# ConfigViewModel1
source: Change made.
fr: Changement réalisé.

# ConfigViewModel16
source: Change made. Please restart the application
fr: Changement réalisé. Merci de redémarrer l'application

# ConfigViewText1
source: Enter the Json file path, language, real-time Json file path, and saved Json file path separated by commas:
fr: Entrez le chemin du fichier Json, la langue, le chemin du fichier Json en temps réel, et le chemin du fichier Json sauvegardé séparés par des virgules:"

# ConfigViewText10
source: 1. Daily log file
fr: 1. Logs journaliers

# ConfigViewText11
source: 2. Language
fr: 2. Langue

# ConfigViewText12
source: 3. Real-time log file
fr: 3. Logs en temps réel

# ConfigViewText13
source: 4. Backup save file
fr: 4. Fichier de sauvegarde des backups

# ConfigViewText14
source: 9. Exit
fr: 9. Quitter

# ConfigViewText15
source: Invalid language. Please enter 'fr' for French or 'en' for English.
fr: Langue non valide. Veuillez entrer 'fr' pour Français ou 'en' pour Anglais.

# ConfigViewText16
source: Enter extension type for logs (.json/.xml) :
fr: Entrez le type d'extension pour les logs (.json/.xml) :

# ConfigViewText17
source: Invalid extension. Please enter '.json' or '.xml'.
fr: Extension non valide. Veuillez entrer '.json' ou '.xml'

# ConfigViewText18
source: 5. Log extension type
fr: 5. Extension des fichiers logs

# ConfigViewText19
source: Please enter an extension type
fr: Veuillez entrer un type d'extension

# ConfigViewText2
source: Return to the main menu
fr: Retour au menu principal

# ConfigViewText20
source: Invalid extension
fr: Extension invalide

# ConfigViewText21
source: Please enter the path to cryptosoft
fr: Veuillez entrer le chemin de cryptosoft

# ConfigViewText22
source: Invalid path
fr: Chemin invalide

# ConfigViewText23
source: 6. Add an extension to encrypt
fr: 6. Ajouter une extension a crypter

# ConfigViewText24
source: 7. Edit cryptosoft path
fr: 7. Editer le chemin de cryptosoft

# ConfigViewText25
source: The configuration has been reset.
fr: La configuration a bien été réinitialisé.

# ConfigViewText26
source: Please enter the id to be deleted
fr: Veuillez saisir l'identifiant a supprimer

# ConfigViewText27
source: Invalid identifier
fr: Identifiant invalide

# ConfigViewText28
source: 8. Delete an extension to be encrypted
fr: 8. Supprimer une extension à crypter

# ConfigViewText3
source: Invalid or non-existent JSON file.
fr: Fichier JSON non valide ou inexistant.

# ConfigViewText4
source: Invalid choice
fr: Choix non valide.

# ConfigViewText5
source: Enter the new path for the log file:
fr: Entrez le nouveau chemin pour le fichier de log :

# ConfigViewText6
source: Enter the new language (fr/en):
fr: Entrez la nouvelle langue (fr/en) :

# ConfigViewText7
source: Enter the new path for the real-time log file:
fr: Entrez le nouveau chemin pour le fichier de log en temps reel :

# ConfigViewText8
source: Enter the new path for the backup save file:
fr: Entrez le nouveau chemin pour le fichier de sauvegarde des backup :

# ConfigViewText9
source: Which field would you like to edit?
fr: Quel champ souhaitez-vous éditer ?

# GestionTask1
source: Delete done.
fr: Suppression terminée.

# GestionTask2
source: The file does not exist
fr: Le fichier n'existe pas.

# GestionTask3
source: Edit done.
fr: Modification terminée.

# GestionTask4
source: The file does not exist
fr: Le fichier n'existe pas

# GestionTask5
source: New destination recorded
fr: Nouvelle destination enregistrée

# GestionTask6
source: New source recorded
fr: Nouvelle source enregistrée

# GestionTask7
source: New type recorded
fr: Nouveau type enregistré

# GestionTaskView1
source: 1. Add a task
fr: 1. Ajouter une tache

# GestionTaskView10
source: Incorrect parameters.
fr: Paramètres incorrects.

# GestionTaskView11
source: Invalid option.
fr: Option invalide.

# GestionTaskView13
source: Enter the backup name:
fr: Entrez le nom de sauvegarde :

# GestionTaskView14
source: Enter the source path:
fr: Entrez le chemin source :

# GestionTaskView15
source: Invalid path, please enter a valid path.
fr: Chemin non valide, veuillez entrer un chemin valide.

# GestionTaskView16
source: Enter the destination path:
fr: Entrez le chemin de destination :

# GestionTaskView17
source: Enter the backup type (A for full, B for differential):
fr: Entrez le type de sauvegarde (A pour complète, B pour differentielle) :

# GestionTaskView18
source: 2. Delete a task
fr: 2. Supprimer une tache

# GestionTaskView19
source: 3. Edit a task
fr: 3. Modifier une tache

# GestionTaskView2
source: Enter the file name, source path, destination path, and backup type separated by commas:
fr: Entrez le nom du fichier, le chemin source, le chemin de destination, et le type de sauvegarde séparés par des virgules:

# GestionTaskView20
source: 4. Exit
fr: 4. Quitter

# GestionTaskView21
source: Return to the main menu.
fr: Retour au menu principal.

# GestionTaskView22
source: Invalid path, please enter a valid path.
fr: Chemin non valide, veuillez entrer un chemin valide.

# GestionTaskView23
source: Invalid entry. Please enter 'A' or 'B'.
fr: Entrée non valide. Veuillez entrer 'A' ou 'B'.

# GestionTaskView24
source: No backups recorded
fr: Aucune sauvegarde enregistrée

# GestionTaskView25
source: Do you want to change the backup source? (y/n)
fr: Voulez-vous modifier la source de la sauvegarde ? (y/n)

# GestionTaskView26
source: Enter the new path for the source:
fr: Entrez le nouveau chemin pour la source :

# GestionTaskView27
source: Invalid path, please enter a valid path.
fr: Chemin non valide, veuillez entrer un chemin valide.

# GestionTaskView28
source: Do you want to change the backup destination? (y/n)
fr: Voulez-vous modifier la destination de la sauvegarde ? (y/n)

# GestionTaskView29
source: Enter the new path for the destination:
fr: Entrez le nouveau chemin pour la destination :

# GestionTaskView3
source: Backup successfully created.
fr: Tâche de sauvegarde créée avec succès.

# GestionTaskView30
source: Invalid path, please enter a valid path.
fr: Chemin non valide, veuillez entrer un chemin valide.

# GestionTaskView31
source: Do you want to change the backup type? (y/n)
fr: Voulez-vous modifier le type de la sauvegarde ? (y/n)

# GestionTaskView32
source: Enter the new backup type (A Complete /B Differential):
fr: Entrez le nouveau type de sauvegarde (A pour complète, B pour differentielle) :

# GestionTaskView33
source: Invalid type, please enter A or B.
fr: Type non valide, veuillez entrer A ou B.

# GestionTaskView34
source: Invalid response, please enter 'y' for yes or 'n' for no.
fr: Réponse non valide, veuillez entrer 'y' pour oui ou 'n' pour non.

# GestionTaskView35
source: The Backup name already exists or is null
fr: Le nom de Backup existe déjà ou est nul

# GestionTaskView4
source: Failed to create backup.
fr: Échec de la création de la tâche de sauvegarde.

# GestionTaskView5
source: Incorrect parameters.
fr: Paramètres incorrects.

# GestionTaskView6
source: Enter the backup ID to delete:
fr: Entrez l'identifiant de la tâche de sauvegarde à supprimer:

# GestionTaskView7
source: Invalid ID.
fr: Identifiant invalide.

# GestionTaskView8
source: Enter the backup ID to edit :
fr: Entrez l'id de la tâche de sauvegarde à modifier :

# GestionTaskView9
source: Invalid ID.
fr: Identifiant invalide.

# GestionTaskViewText35
source: Name is already taken. Please enter another.
fr: Nom déjà existant. Veuillez entrer un autre nom.

# InterfaceStrategy1
source: The source folder does not exist.
fr: Le dossier source n'existe pas.

# InterfaceStrategy2
source: Task interrupted : blocking process detected
fr: La sauvegarde a été interrompue car le processus bloquant est détecté.

# JsonManager1
source: The file does not exist.
fr: Le fichier n'existe pas.

# MenuPrincipal1
source: Main Menu:
fr: Menu Principal :

# MenuPrincipal2
source: 1. Execute a task
fr: 1. Exécuter une tâche

# MenuPrincipal3
source: 2. Task management
fr: 2. Gestion des tâches

# MenuPrincipal4
source: 3. Edit configuration
fr: 3. Paramètres

# MenuPrincipal5
source: 4. Exit
fr: 4. Quitter

# MenuPrincipal6
source: Please enter your choice (1-4):
fr: Veuillez entrer votre choix (1-4):

# MenuPrincipal7
source: Exiting the program...
fr: Quitter le programme...

# MenuPrincipal8
source: Invalid choice. Please try again.
fr: Choix invalide. Veuillez essayer à nouveau.

# RunTaskView1
source: 1. Launch a task
fr: 1. Lancer une tâche

# RunTaskView10
source: Invalid input
fr: Entrée invalide

# RunTaskView11
source: Backup of all selected tasks finished successfully.
fr: Sauvegarde de toutes les tâches sélectionnées terminée avec succès.

# RunTaskView12
source: A problem occurred during the backup of tasks.
fr: Un problème est survenu lors de la sauvegarde des tâches.

# RunTaskView13
source: Error
fr: Erreur

# RunTaskView14
source: 2. Launch multiple successive tasks
fr: 2. Lancer plusieurs tâches successives

# RunTaskView15
source: 3. Launch a list of tasks
fr: 3. Lancer une liste de tâches

# RunTaskView16
source: 4. Exit
fr: 4. Quitter

# RunTaskView17
source: The end ID must be higher than the start ID.
fr: L'ID de fin doit être supérieur à l'ID de départ.

# RunTaskView18
source: Return to the main menu
fr: Retour au menu principal

# RunTaskView19
source: The specified IDs are not valid.
fr: Les IDs spécifiés ne sont pas valides.

# RunTaskView2
source: Enter the task ID you want to run
fr: Entrez l'ID de la tâche que vous voulez effectuer

# RunTaskView20
source: The specified ID is not valid. Please enter a numeric ID corresponding to an existing backup.
fr: L'ID spécifié n'est pas valide. Veuillez entrer un ID numérique correspondant à une sauvegarde existante.

# RunTaskView21
source: You have no saved task
fr: Aucune sauvegarde enregistrée

# RunTaskView22
source: Task blocked : blocking process interrupted
fr: La sauvegarde a été bloquée car le processus bloquant est détecté.

# RunTaskView3
source: Backup done.
fr: Sauvegarde terminée.

# RunTaskView4
source: A problem occurred
fr: Un problème est survenu.

# RunTaskView5
source: Enter the ID of the first and last task you want to perform, separated by a comma (example: 2,5):
fr: Entrez l'ID de la première et de la dernière tâche que vous voulez effectuer, séparés par une virgule (exemple: 2,5):

# RunTaskView6
source: Backup done.
fr: Sauvegarde terminée.

# RunTaskView7
source: A problem occurred.
fr: Un problème est survenu.

# RunTaskView8
source: Invalid input. Please enter exactly two valid IDs, separated by a comma.
fr: Entrée invalide. Veuillez entrer exactement deux IDs valides, séparés par une virgule.

# RunTaskView9
source: Enter the IDs of the tasks you want to perform, separated by commas (example: 1,3,5):
fr: Entrez les ID des tâches que vous voulez effectuer, séparés par des virgules (exemple: 1,3,5):
